import React from 'react';
import { Header1, Header3, Paragraph } from '@/components/typography';
import { Link } from 'lucide-react';

export const metadata = {
  title: 'UA Urban - Умови користування сайтом',
};

const TermsConditionsPage = () => {
  return (
    <section>
      <Header1>Умови користування</Header1>
      <Paragraph>
        Ласкаво просимо на сайт «UA Urban»! Нижче наведені умови користування, які регулюють ваш доступ та використання нашого сервісу. Будь ласка, уважно прочитайте цей документ перед використанням сайту.
      </Paragraph>

      <Header3>Прийняття умов.</Header3>
      <Paragraph>
        Користуючись нашим сайтом, ви погоджуєтеся з цими умовами користування в повному обсязі. Якщо ви не згодні з будь-якою частиною цих умов, будь ласка, не використовуйте наш сервіс.
      </Paragraph>
      <Header3>Мета сайту</Header3>
      <Paragraph>
        Основною метою є збір та поширення коректної та корисної інформації про сучасну українську мову в формі доступній необмеженому колу осіб. 
      </Paragraph>

      <Header3>Вміст</Header3>
      <Paragraph>
        Користувачі мають можливість додавати нові слова та визначення до словника, а також голосувати за якість визначень. Додаючи слова, визначення та інший контент до сайту ви погоджуєтеся з тим, що він може бути вільно використаний адміністрацією сайту або третіми особами в будь-якій формі з некомерційною або комерційною метою. Адміністрація сайту не несе відповідальності за контент, створений користувачами.
      </Paragraph>

      <Header3>Обмеження</Header3>
      <Paragraph>
        Веб-сайт не підходить для всіх аудиторій. Його зміст часто представлений у грубій і прямій формі, що може бути для когось образливим.Якщо ви не вважаєте себе відповідним користувачем або ображені, будь ласка, не відвідуйте Веб-сайт. 
      </Paragraph>
      <Paragraph>
        Сайт не призначений для дітей молодше 16 років. Використовуючи Веб-сайт, ви підтверджуєте, що вам виповнилося 16 років. 
      </Paragraph>
      <Paragraph>
        Ви не можете використовувати Сайт для будь-якої незаконної діяльності або порушення законів у вашій юрисдикції.Ви не можете використовувати Сайт для отримання доступу до несанкціонованої інформації.
      </Paragraph>

      <Header3>Модерація</Header3>
      <Paragraph>
        Ми робимо все можливе, щоб забезпечити якість та безпеку нашого сервісу. Адміністрація сайту здійснює модерацію контенту та може вилучати будь-який вміст, що порушує чинник законодавство України або протирічить меті та ідеї сайту. Вилучення відбувається без попереднього повідомлення.
      </Paragraph>

      <Header3>Персональні дані</Header3>
      <Paragraph>
        Деякі функції нашого сайту доступні тільки для зареєстрованих користувачів. Дані, що ви надаєте ми використовуємо відповідно до <Link href="/privacy">політики конфіденційності</Link>.
      </Paragraph>
      
      <Header3>Обмеження відповідальності</Header3>
      <Paragraph>
        {`Веб-сайт надається за принципом "як є" і "як доступно", без будь-яких явних або неявних гарантій будь-якого виду. Ми прямо відмовляємося від будь-яких неявних гарантій придатності для продажу, гарантій придатності для певної мети, гарантій непорушення прав або будь-яких гарантій того, що використання веб-сайту буде безперервним або безпомилковим. Ви берете на себе повну відповідальність і ризик за використання вами веб-сайту.`}
      </Paragraph>
      <Paragraph>
        В повній мірі, дозволеній чинним законодавством, за жодних обставин і за жодної правової теорії компанія, її ліцензіари або постачальники не несуть відповідальності перед вами або будь-якою іншою особою за будь-які непрямі, спеціальні, випадкові або побічні збитки будь-якого виду.
      </Paragraph>

      <Header3>Зміни умов</Header3>
      <Paragraph>
        Ми залишаємо за собою право змінювати ці умови користування в будь-який час без попереднього повідомлення. Будь ласка, регулярно перевіряйте цей документ на наявність змін.
      </Paragraph>
      
    </section>
  );
}

export default TermsConditionsPage;
