import React from 'react';
import { Header1, Header2, Header3, Paragraph } from '@/components/typography';

export const metadata = {
  title: 'UA Urban - Політика конфіденційності',
};

const PrivacyPolicyPage = () => {
  return (
    <section>
      <Header1 className="mb-2">Політика конфіденційності</Header1>
      <p className="text-sm text-foreground/60">Востаннє оновлено 30-квітня-2024</p>
      <p className="text-sm text-foreground/60">Дата набуття чинності 30-квітня-2024</p> 
      
      <Paragraph>
        Ця Політика конфіденційності описує політику сайту UA Urban щодо збору, використання та розкриття вашої інформації, яку ми збираємо під час використання вами нашого веб-сайту (<strong>http://www.urban.in.ua/</strong>). (&quot;Сервіс&quot;). Отримуючи доступ до Сервісу або користуючись ним, ви даєте згоду на збір, використання та розкриття вашої інформації відповідно до цієї Політики конфіденційності. Якщо ви не згодні з цим, будь ласка, не отримуйте доступ до Сервісу та не користуйтеся ним. 
      </Paragraph>
      <Paragraph>
        Ми можемо змінити цю Політику конфіденційності в будь-який час без будь-якого попереднього повідомлення і опублікуємо переглянуту Політику конфіденційності на Сервісі. Переглянута Політика набуває чинності через 180 днів з моменту її публікації в Сервісі, і ваш подальший доступ або використання Сервісу після закінчення цього терміну буде означати вашу згоду з переглянутою Політикою конфіденційності. Тому ми рекомендуємо вам періодично переглядати цю сторінку. 
      </Paragraph>

      <Header3>Як ми збираємо вашу інформацію:</Header3>
      <Paragraph>
        Ми збираємо/отримуємо інформацію про вас наступним чином: 
      </Paragraph>
      
      <ul className="my-6 ml-6 list-disc [&>li]:mt-2">
        <li>Коли користувач заповнює реєстраційну форму або іншим чином надає особисту інформацію</li>
        <li>Взаємодіє з веб-сайтом</li>
        <li>З відкритих джерел</li>
      </ul>
      
      <Header3>Як ми використовуємо вашу інформацію:</Header3>
      <Paragraph>
        Ми будемо використовувати інформацію, яку ми збираємо про вас, для наступних цілей: 
      </Paragraph>

      <ul className="my-6 ml-6 list-disc [&>li]:mt-2">
        <li>Створення облікового запису користувача</li>
        <li>Отримання зворотнього звʼязку</li>
        <li>Реалізація функціоналу сайту</li>
        <li>Управління обліковим записом користувача</li>
      </ul>
      
      <Paragraph>
        Якщо ми захочемо використовувати вашу інформацію для будь-яких інших цілей, ми запитаємо у вас згоду і будемо використовувати вашу інформацію тільки після отримання вашої згоди і тільки для цілей, для яких ви надали згоду, якщо тільки ми не зобов&apos;язані діяти інакше за законом.
      </Paragraph>

      <Header2>Як ми ділимося вашою інформацією:</Header2>
      <Paragraph>
        Ми не будемо передавати вашу особисту інформацію третім особам без вашої згоди, за винятком обмежених обставин, описаних нижче:
      </Paragraph>

      <ul className="my-6 ml-6 list-disc [&>li]:mt-2">
        <li>Персоналізовані рекламні оголошення</li>
        <li>Аналітика</li>
      </ul>
      <Paragraph>
        Ми вимагаємо від таких третіх осіб використовувати передану нам особисту інформацію лише з тією метою, з якою вона була передана, і не зберігати її довше, ніж це необхідно для виконання зазначеної мети.
      </Paragraph>

      <Paragraph>
      Ми також можемо розкрити вашу особисту інформацію для наступних цілей (1) для дотримання чинного законодавства, нормативних актів, судового наказу або іншого юридичного процесу; (2) для забезпечення виконання ваших угод з нами, включаючи цю Політику конфіденційності; або (3) для відповіді на претензії про те, що використання вами Сервісу порушує будь-які права третіх осіб. Якщо Сервіс або наша компанія буде об&apos;єднана або придбана іншою компанією, ваша інформація буде одним з активів, який передається новому власнику.
      </Paragraph>

      <Header2>Права користувача</Header2>
      <Paragraph>
      Залежно від законодавства, що застосовується, ви можете мати право на доступ до ваших персональних даних, їх виправлення або видалення, отримання копії ваших персональних даних, обмеження або заперечення проти активної обробки ваших даних, прохання про передачу (перенесення) ваших персональних даних іншій особі, відкликання будь-якої згоди, яку ви надали нам на обробку ваших даних, право подати скаргу до встановленого законом органу, а також інші права, які можуть мати відношення до застосовного законодавства. Щоб скористатися цими правами, ви можете написати нам на <strong>support@urban.in.ua</strong>. Ми відповімо на ваш запит відповідно до чинного законодавства.
      </Paragraph>

      <Paragraph>
      Зверніть увагу, що якщо ви не дозволите нам збирати або обробляти необхідну особисту інформацію або відкличете згоду на її обробку в необхідних цілях, ви не зможете отримати доступ або користуватися послугами, для яких запитувалася ваша інформація.
      </Paragraph>

      <Header3>Безпека</Header3>
      <Paragraph>
      Безпека вашої інформації важлива для нас, і ми будемо вживати розумних заходів безпеки, щоб запобігти втраті, неправильному використанню або несанкціонованій зміні вашої інформації, яка знаходиться під нашим контролем. Однак, враховуючи властиві ризики, ми не можемо гарантувати абсолютну безпеку, а отже, ми не можемо забезпечити або гарантувати безпеку будь-якої інформації, яку ви нам передаєте, і ви робите це на свій страх і ризик.
      </Paragraph>

      <Header3>Посилання на третіх осіб</Header3>
      <Paragraph>
        Наш Сервіс може містити посилання на інші веб-сайти, якими ми не керуємо. Ця Політика конфіденційності не стосується політики конфіденційності та інших практик будь-яких третіх сторін, включаючи будь-яку третю сторону, яка керує будь-яким веб-сайтом або послугою, доступ до яких можна отримати за посиланням на нашому Сервісі. Ми наполегливо рекомендуємо вам переглядати політику конфіденційності кожного сайту, який ви відвідуєте. Ми не контролюємо і не несемо жодної відповідальності за зміст, політику конфіденційності або практику будь-яких сайтів або послуг третіх осіб.
      </Paragraph>
    </section>
  );
};

export default PrivacyPolicyPage;
